Tekla.Structures.Geometry3d.SolidExtensions
The Tekla.Structures.Geometry3d.SolidExtensions class provides a set of methods to query instances of the Tekla.Structures.Model.Solid type.

Tekla.Structures.Geometry3d.SolidExtensions.Tolerance
The tolerance.

Tekla.Structures.Geometry3d.SolidExtensions.GetIntersectionFaces(Tekla.Structures.Model.Solid,Tekla.Common.Geometry.Plane3)
The get intersection faces.
solid: The solid.
plane3: The plane 3.
Returns: The IList.

Tekla.Structures.Geometry3d.SolidExtensions.TryFindEdgeContainingPoint(Tekla.BIM.Geometry.Face3,Tekla.Common.Geometry.Vector3,System.Nullable{Tekla.Common.Geometry.Segment3}@)
The is point on edge.
face: The face.
point: The point.
edge: The edge.
Returns: The System.Boolean.

Tekla.Structures.Geometry3d.SolidExtensions.ContainsPartOf(Tekla.BIM.Geometry.Face3,Tekla.Common.Geometry.Segment3)
Determines whether part of the given Tekla.Common.Geometry.Segment3 is within the Tekla.BIM.Geometry.Face3.
face: The Tekla.BIM.Geometry.Face3.
segment: The Tekla.Common.Geometry.Segment3.
Returns: True if part of the segemnt is within the face.

Tekla.Structures.Geometry3d.SolidExtensions.GetFaces(Tekla.Structures.Model.Solid)
Gets all solid faces as Tekla.BIM.Geometry.Face3 values.
solid: The solid to get all faces from.
Returns: An System.Collections.Generic.IEnumerable`1 providing the Tekla.BIM.Geometry.Face3 values.

Tekla.Structures.Geometry3d.SolidExtensions.FindEdgeThatContainsPoint(Tekla.Structures.Model.Solid,Tekla.Common.Geometry.Vector3)
Finds the edge that contains the given point.
solid: The solid to get the edges from.
point: The point.
Returns: The edge that contains the given point. Null if no edge contains the point.

Tekla.Structures.Geometry3d.SolidExtensions.FindFacesThatContainCollinearEdges(Tekla.Structures.Model.Solid,System.Collections.Generic.IEnumerable{Tekla.Common.Geometry.Segment3})
Finds the faces belonging to the solid that contain any edge which is collinear to at least
one of the given edges.
solid: The solid to get the faces from.
edges: The edges.
Returns: The faces belonging to the solid that contain the given edges.

Tekla.Structures.Geometry3d.SolidExtensions.TryGetClosestEdgeTo(System.Collections.Generic.IEnumerable{Tekla.BIM.Geometry.Face3},Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Segment3@)
Gets the closest edge of the faces to the specified Tekla.Common.Geometry.Vector3 value.
faces: The faces to get the closest edge from.
point: The Tekla.Common.Geometry.Vector3 to get the closest edge to.
closestEdge: The closest solid edge as a Tekla.Common.Geometry.Segment3 value.
Returns: True if faces defines resolvable segments; otherwise, false.

Tekla.Structures.Geometry3d.SolidExtensions.TryGetClosestEdgeTo(Tekla.Structures.Model.Solid,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Segment3@)
Gets the closest edge of the solid to the specified Tekla.Common.Geometry.Vector3 value.
solid: The Tekla.Structures.Model.Solid to get the closest edge from.
point: The Tekla.Common.Geometry.Vector3 to get the closest edge to.
closestEdge: The closest solid edge as a Tekla.Common.Geometry.Segment3 value.
Returns: True if solid defines resolvable segments; otherwise, false.

Tekla.Structures.Geometry3d.SolidExtensions.TryGetFace(System.Collections.Generic.IEnumerable{Tekla.BIM.Geometry.Face3},Tekla.Common.Geometry.UnitVector3,Tekla.Common.Geometry.Vector3,Tekla.BIM.Geometry.Face3@)
Gets the face which has the specified normal and contains the given pointOnFace.
If no matching face is found, the closest match is outputted by the face parameter.
faces: The faces to get a face from.
normal: The normal of the face to get.
pointOnFace: Any point on the expected face.
face: The face having the specified normal and containing the given pointOnFace.
Returns: True if an exact match is found; otherwise, false.

Tekla.Structures.Geometry3d.SolidExtensions.TryGetFace(Tekla.Structures.Model.Solid,Tekla.Common.Geometry.UnitVector3,Tekla.Common.Geometry.Vector3,Tekla.BIM.Geometry.Face3@)
Gets the face of the given solid which has the specified normal and contains the given pointOnFace.
If no matching face is found, the closest match is outputted by the face parameter.
solid: The solid to get a face from.
normal: The normal of the face to get.
pointOnFace: Any point on the expected face.
face: The face having the specified normal and containing the given pointOnFace.
Returns: True if an exact match is found; otherwise, false.

Tekla.Structures.Geometry3d.SolidExtensions.ClosestFaceTo(System.Collections.Generic.IEnumerable{Tekla.BIM.Geometry.Face3},Tekla.Common.Geometry.Vector3)
Gets the closest face to the specified Tekla.Common.Geometry.Vector3 value.
faces: The faces to get the closest face from.
point: The Tekla.Common.Geometry.Vector3 to get the closest face to.
Returns: The closest face as a Tekla.BIM.Geometry.Face3 value.

Tekla.Structures.Geometry3d.SolidExtensions.ClosestFaceTo(Tekla.Structures.Model.Solid,Tekla.Common.Geometry.Vector3)
Gets the closest face of the solid to the specified Tekla.Common.Geometry.Vector3 value.
solid: The Tekla.Structures.Model.Solid to get the closest face from.
point: The Tekla.Common.Geometry.Vector3 to get the closest face to.
Returns: The closest solid face as a Tekla.BIM.Geometry.Face3 value.